{
  "FC Visitors - Captive Portal": "FC Goście - Captive Portal",
  "FC visitors captive portal": "FC Goście captive portal",
  "FC Visitors": "FC Goście",
  "Log in": "Logowanie",
  "Why token instead of password": "Dlaczego token zamiast hasła",
  "That you also wanted to know": "Że też Ci się chciało",
  "Congratulations": "Gratulacje",
  "You can now use the internet.": "Możesz teraz korzystać z internetu.",
  "Enter the token": "Podaj token",
  "To access the internet you must generate and enter a special token in the form below.": "Aby uzyskać dostęp do internetu musisz wygenerować i podać w poniższym formularzu specjalny token.",
  "The tokenizer is on the dresser in the hall. If you need help, ask one of the household members for it (Tosia can also generate a token, just raise it to the height of the router - it will know what to do next).": "Tokenizer znajduje się na komodzie w przedpokoju. Jeżeli potrzebujesz pomocy, poproś o nią któregoś z domowników (Tosia też potrafi wygenerować token, wystarczy podnieść ją na wysokość routera - będzie wiedziała co robić dalej).",
  "Use the button": "Użyj przycisku",
  "In the hall next to the router is a small white box with a green button. When you press the button, the device will generate and display a token prepared especially for you.": "W przedpokoju obok routera znajduje się małe, białe pudełko z zielonym przyciskiem. Kiedy wciśniesz przycisk, urządzenie wygeneruje i wyświetli token przygotowany specjalnie dla Ciebie.",
  "Rewrite the token": "Przepisz token",
  "Enter the generated token into the form above. Hurry up, the token displays only 10 seconds!": "Przepisz wygenerowany token do formularza znajdującego się powyżej. Pośpiesz się, token wyświetla się tylko 10 sekund!",
  "Ready!": "Gotowe!",
  "Enjoy easy internet access in our home.": "Ciesz się łatwym dostępem do internetu w naszym domu. :-)",
  "Hide instruction": "Ukryj instrukcję",
  "Show instruction": "Pokaż instrukcję",
  "Why token instead of password?": "Dlaczego token zamiast hasła?",
  "There used to be a password. It hung on the wall and anyone could just enter it. And who bothered it? Why did you change it?": "Przecież kiedyś było hasło. Wisiało sobie na ścianie i każdy mógł je po prostu wpisać. I komu to przeszkadzało? Po co to zmieniałeś?",
  "The password was long and consisted of probably 37 characters. It had to be long because it didn't change - so each neighbor had plenty of time to try to guess it. This caused some problems - most people typed them incorrectly the first time, so you had to start everything from the beginning. Unfriendly user interfaces on mobile devices did not improve the situation - you did not even know where you made the mistake.": "Hasło było długie i składało się z bodajże 37 znaków. Musiało być długie, ponieważ się nie zmieniało - więc każdy sąsiad miał mnóstwo czasu, aby próbować je odgadnąć. Powodowało to pewne problemy - większość ludzi za pierwszym razem wpisywała je błędnie, przez co trzeba było zaczynać wszystko od początku. Mało przyjazne interfejsy użytkownika na urządzeniach mobilnych dodatkowo nie poprawiały sytuacji - nie wiedziałeś nawet, gdzie popełniłeś błąd.",
  "For a change, the token has only a few characters. This can be because it only works for a few minutes after being generated. Thanks to this, it ensures a level of security similar to that of a long password.": "Dla odmiany token ma tylko kilka znaków. Może taki być, ponieważ działa tylko przez parę minut po wygenerowaniu. Dzięki temu zapewnia poziom bezpieczeństwa zbliżony do długiego hasła.",
  "In addition, the token is handled via a friendly web interface, so even if you rewrite it incorrectly, you'll have the chance to see where you made the mistake and quickly correct it.": "Dodatkowo token obsługuje się poprzez przyjazny interfejs WWW, więc nawet jeśli przepiszesz go niepoprawnie, będziesz miał szansę zobaczyć gdzie popełniłeś błąd i szybko go poprawić.",
  "Easier login for you ...": "Dla Ciebie prostsze logowanie...",
  "Of course, motivation is not everything. I had a lot of fun building and programming the entire system. As a result, you have easier access to the internet and I am happier. Win-win. ;-)": "Motywacja to oczywiście nie wszystko. Miałem mnóstwo frajdy budując i oprogramowując cały system. W efekcie ty masz łatwiejszy dostęp do internetu, a ja jestem szczęśliwszy. Win-win. ;-)",
  "Why did I want to": "Dlaczego mi się chciało",
  "So many hours of work, late weekend nights and all just to do exactly what you do at work. It's some kind of paranoia, you're insane.": "Tyle godzin roboty, zarwane weekendowe noce i to wszystko tylko po, żeby robić dokładnie to samo co robisz w pracy. Przecież to jakaś paranoja, jesteś nienormalny.",
  "It will be difficult to explain to a layman, but building this project is not at all similar to what I do professionally. They are two different worlds and that's why I could finally ": "Ciężko to będzie wyjaśnić laikowi, ale budowanie tego projektu nie jest ani trochę zbliżone do tego, czym zajmuję się zawodowo. To dwa różne światy i właśnie dzięki temu mogłem w końcu ",
  "REST": "ODPOCZĄĆ",
  " from work and take care of something completely different.": " od pracy i zająć głowę czymś z zupełnie innym.",
  "Writing software for a microcontroller is fun in its purest form. There is no operating system, no file systems, generally nothing - but somehow you have to deal with it. The captive portal itself was also specially written in Lua, which - compared to what I use at work - is simply hardcore low-level.": "Pisanie oprogramowania dla mikrokontrolera to zabawa w najczystszej postaci. Nie ma systemu operacyjnego, nie ma systemów plików, generalnie nie ma nic - ale jakoś trzeba sobie poradzić. Sam captive portal również specjalnie napisałem w języku Lua, który - w porównaniu do tego, czego używam w pracy - jest po prostu hardcorowo niskopoziomowy.",
  "So please treat it as broadening the horizons that everyone has benefited from.": "Potraktuj więc to proszę jako poszerzanie horyzontów, na którym wszyscy skorzystali.",
  "404 - Page Not Found.": "404 - strony nie znaleziono.",
  "Unfortunately, the page you are trying to view is not available on our portal. Choose another item from the menu or return to the login page.": "Niestety, strona którą próbujesz wyświetlić nie jest dostępna w naszym portalu. Wybierz inny element z menu lub wróć do strony logowania.",
  "Remember that if you try to do something ugly, Igor will automatically notify the nearest police station!": "Pamiętaj, że jeśli próbujesz zrobić coś brzydkiego, to Igor automatycznie powiadomi najbliższy posterunek policji!",
  "Return to login page": "Wróć do strony logowania",
  "Next": "Dalej",
  "Enter your token": "Wpisz swój token",
  "AUTHOR": "Patryk Kozłowski",
  "AUTHOR_SUFFIX": ""
}
