{
  "FC Visitors": "FC 认证",
  "Log in": "登录",
  "Why token instead of password": "为什么选择验证码而非使用密码",
  "That you also wanted to know": "关于",
  "Congratulations": "恭喜",
  "You can now use the internet.": "成功接入互联网",
  "Enter the token": "输入验证码",
  "To access the internet you must generate and enter a special token in the form below.": "想要接入互联网，你需要生成并在下方表单输入验证码",
  "The tokenizer is on the dresser in the hall. If you need help, ask one of the household members for it (Tosia can also generate a token, just raise it to the height of the router - it will know what to do next).": "验证码生成器位于大厅桌子上，联系工作人员/家庭成员获取验证码。（Tosia 也可以生成验证码，只需将其提升至路由器层级即可）",
  "Use the button": "按下按钮",
  "In the hall next to the router is a small white box with a green button. When you press the button, the device will generate and display a token prepared especially for you.": "按下大厅路由器旁边的白盒子上的绿色按钮，它将生成并向你展示一个可用验证码。",
  "Rewrite the token": "填写验证码",
  "Enter the generated token into the form above. Hurry up, the token displays only 10 seconds!": "将验证码输入上方表格，注意验证码将在10秒后消失！",
  "Ready!": "准备好了！",
  "Enjoy easy internet access in our home.": "开始享受家庭网络吧 ^_^",
  "Hide instruction": "隐藏帮助",
  "Show instruction": "显示帮助",
  "Why token instead of password?": "为什么使用验证码而非密码？",
  "There used to be a password. It hung on the wall and anyone could just enter it. And who bothered it? Why did you change it?": "曾经这里使用密码，它挂在墙上所以所有人可以输入，但是没有人会去修改它。",
  "The password was long and consisted of probably 37 characters. It had to be long because it didn't change - so each neighbor had plenty of time to try to guess it. This caused some problems - most people typed them incorrectly the first time, so you had to start everything from the beginning. Unfriendly user interfaces on mobile devices did not improve the situation - you did not even know where you made the mistake.": "密码很长可能有37个字符，为了安全防止附近的人暴力猜解它必须有这么长，因此带来一个问题，大部分人都会输错，输错了你需要重头开始，这对于移动设备而言尤其致命，因为你不知道错在哪。",
  "For a change, the token has only a few characters. This can be because it only works for a few minutes after being generated. Thanks to this, it ensures a level of security similar to that of a long password.": "因此我们做出改变，验证码必须简短，而为了安全简短就必须缩短它的生命周期到几分钟，从而保证其安全性不亚于长密码。",
  "In addition, the token is handled via a friendly web interface, so even if you rewrite it incorrectly, you'll have the chance to see where you made the mistake and quickly correct it.": "另外，验证码由一个友好的网页提供认证服务，所以当你输入错误时，你可以回头检查哪里输错了，从而快速修正。",
  "Easier login for you ...": "更便捷的认证方式……",
  "Of course, motivation is not everything. I had a lot of fun building and programming the entire system. As a result, you have easier access to the internet and I am happier. Win-win. ;-)": "当然，动机不是一切，编写整套系统十分有趣，而带来的结果是你获得了快速联网的体验而我很开心，双赢(*^▽^*)",
  "Why did I want to": "为什么我要这么做",
  "So many hours of work, late weekend nights and all just to do exactly what you do at work. It's some kind of paranoia, you're insane.": "花费很多心思，周末的通宵达旦做这些和工作一样的事情，某种程度上像是一个偏执狂，一个疯子。",
  "It will be difficult to explain to a layman, but building this project is not at all similar to what I do professionally. They are two different worlds and that's why I could finally ": "有时候很难向一个外行解释，但是编写这样一个项目和我的工作专业不尽相同，它们是完全不同的两个事物，因此做这些事情对我而言也是一种工作之余的",
  "REST": "放松",
  " from work and take care of something completely different.": "。",
  "Writing software for a microcontroller is fun in its purest form. There is no operating system, no file systems, generally nothing - but somehow you have to deal with it. The captive portal itself was also specially written in Lua, which - compared to what I use at work - is simply hardcore low-level.": "编写微处理程序是一件很有趣的事情，它没有高级操作系统，没有文件系统，甚至可以说什么都没有，但是你必须做些什么来处理它。这个网络认证系统自身也是使用 Lua 语言编写，和我工作相比它比较底层。",
  "So please treat it as broadening the horizons that everyone has benefited from.": "所以实际上它是一种扩展自身技术视野的东西，所有人都能从中受益。",
  "404 - Page Not Found.": "404 - 页面无法找到",
  "Unfortunately, the page you are trying to view is not available on our portal. Choose another item from the menu or return to the login page.": "抱歉，您访问的页面暂时无法提供服务，请选择其他项目或返回登录页。",
  "Remember that if you try to do something ugly, Igor will automatically notify the nearest police station!": "注意如果你试图做一些非法的操作，系统将会自动记录并警告管理员。",
  "Return to login page": "返回登录页面",
  "Next": "下一步",
  "Enter your token": "输入验证码",
  "FOOTER_SUFFIX": " - 翻译： 茗伊"
}
